10/data/attachments/9e88e8e7955c11fa.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_e640d8d4-cc95-4499-a45e-95bdf4047d43</nif:username>
            <nif:friendToBeAdded>Louis_business_Friend_81071_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>